matthewpanizza/SolarPack-MPPT/device_support/f2806x/v151/MWare/boot_loader/bl_usb.c
    if((ulStart >= readLong(&(g_sDFUDeviceInfo.ulAppStartAddr))) && (ulLength <=
       (readLong(&(g_sDFUDeviceInfo.ulFlashTop)) - readLong(&(g_sDFUDeviceInfo.ulAppStartAddr)))) &&
       ((ulStart + ulLength) <= readLong(&(g_sDFUDeviceInfo.ulFlashTop))))   
    {
        //
        // The block passed lies wholly within the flash address range of
        // this device.
        //
        return(true);
    }
    else
    {
        //
        // We were passed an address that is out of range so set the
        // appropriate status code.
        //
        g_eDFUStatus = STATUS_ERR_ADDRESS;
        return(false);
    }
}

//*****************************************************************************
//
//! Flash API callback (used to kick the watchdog)
//
//*****************************************************************************
#ifdef ENABLE_WATCHDOG
void FlashAPICallback(void)
{
    // Kick the watchdog
    EALLOW;
    SysCtrlRegs.WDKEY = 0x0055;
    SysCtrlRegs.WDKEY = 0x00AA;
    EDIS;        
}
#endif

//*****************************************************************************
//
//! Initialize variables needed by the flash api
//
//*****************************************************************************
void FlashAPIInit(void)
{
    EALLOW;
    Flash_CPUScaleFactor = SCALE_FACTOR;
#ifdef ENABLE_WATCHDOG    
    Flash_CallbackPtr = FlashAPICallback;
#else
    Flash_CallbackPtr = 0;
#endif    
    EDIS;    
    
}

//*****************************************************************************
//
//! Get the sector index given a start address and size
//!
//! \param ulAddress is the address of the block of flash to erase.
//! \param ulSize is the size of the block of memory to return the index for
//!
//! This function converts and address and size into the index format used
//! by the flash erase function.
//!
//! \return Index for use with flash erase function
//
//*****************************************************************************
unsigned long
FlashAPIIndex(unsigned long ulAddress, unsigned long ulSize)
{
    volatile unsigned long ulIdx;
    volatile unsigned long ulTemp;
    
    //Runtime check
    if((ulAddress < FLASH_START_ADDR) || 
      ((ulAddress + ulSize) > FLASH_END_ADDR))
        return 0;
        
    ulTemp = 0;

    for(ulIdx = FLASH_START_ADDR ; ulIdx <= FLASH_END_ADDR ; ulIdx += FLASH_PAGE_SIZE)
        {
        if((ulIdx >= (unsigned long)ulAddress) && (ulIdx <= ((unsigned long)ulAddress + ulSize)))
            ulTemp = (ulTemp << 1) | 1;
        
        
    }
    return ulTemp;
}

#ifdef ENABLE_WATCHDOG
//*****************************************************************************
//
//! Enable the watchdog timer
//
//*****************************************************************************
void WatchdogEnable(void)
{
    EALLOW;
    //Enable the watchdog
    SysCtrlRegs.WDCR = 0x4E;
    EDIS;
}
#endif


#ifdef ENABLE_CSM_CONTROL
//*****************************************************************************
//
//! Generate a seed for CSM authentication
//
//*****************************************************************************
void GenerateSeed(void)
{
    volatile unsigned char i;
    // Stir up the random number generator
    srand(i);
    srand(rand() % 0xFFFF);
    // Create seed
    for(i=0; i<16; i++)
    {
        g_pucSeedBuffer[i] = rand() % 0xFF;    
    }
}

//*****************************************************************************
//
//! Calculate the key for a given seed
//
//*****************************************************************************
void GenerateKey(void)
{
#if KEY_FORM == KEY_SET
    //
    // Set the key to use for encryption
    //
    aes_setkey_enc(&g_aesCtx, g_ucKey, 128);
    // Encrypt the seed
    aes_crypt_ecb(&g_aesCtx, AES_ENCRYPT, g_pucSeedBuffer,
              g_pucKeyBuffer);
    
#else
    const unsigned long * puKey;
    //
    // Get the expanded key to use for encryption
    //
    puKey = AESExpandedEncryptKeyData();
    // Encrypt the seed
    aes_crypt_ecb(puKey, AES_ENCRYPT, g_pucSeedBuffer,
          g_pucKeyBuffer);

#endif    
    
}

//*****************************************************************************
//
//! Unlock the device's code security module
//
//*****************************************************************************
void UnlockDevice(void)
{
    volatile unsigned long ulTemp;
    EALLOW;
    // Write the key locations
    CsmRegs.KEY0 = PWL0;
    CsmRegs.KEY1 = PWL1;
    CsmRegs.KEY2 = PWL2;
    CsmRegs.KEY3 = PWL3;
    CsmRegs.KEY4 = PWL4;
    CsmRegs.KEY5 = PWL5;
    CsmRegs.KEY6 = PWL6;
    CsmRegs.KEY7 = PWL7;
    // Read password locations
    ulTemp = CsmPwl.PSWD0;
    ulTemp = CsmPwl.PSWD1;
    ulTemp = CsmPwl.PSWD2;
    ulTemp = CsmPwl.PSWD3;
    ulTemp = CsmPwl.PSWD4;
    ulTemp = CsmPwl.PSWD5;
    ulTemp = CsmPwl.PSWD6;
    ulTemp = CsmPwl.PSWD7;
    EDIS;
    // Wait while device unlocks
    while(CsmRegs.CSMSCR.bit.SECURE);
    // Report unlock status in device structure
    g_sDFUDeviceInfo.ucLocked = 0;
    
}
#endif

//*****************************************************************************
//
//! Process TI-specific commands passed via DFU download requests.
//!
//! \param pcCmd is a pointer to the first byte of the \b DFU_DNLOAD payload
//! that is expected to hold a command.
//! \param ulSize is the number of bytes of data pointed to by \e pcCmd.
//! This function is called when a DFU download command is received while in
//! \b STATE_IDLE.  New downloads are assumed to contain a prefix structure
//! containing one of several TI-specific commands and this function
//! is responsible for parsing the download data and processing whichever
//! command is contained within it.
//!
//! \return Returns \b true on success or \b false on failure.
//
//*****************************************************************************
tBoolean
ProcessDFUDnloadCommand(tDFUDownloadHeader *pcCmd, unsigned long ulSize)
{
    //
    // Make sure we got enough data to contain a valid command header.
    //
    if(ulSize < sizeof(tDFUDownloadHeader))
    {
        return(false);
    }

    //
    // Remember the command that we have been passed since we will need thi
    // to determine which state to transition to on exit from STATE_DNLOAD_SYNC.
    //
    g_ucLastCommand = pcCmd->ucCommand;

    //
    // Which command have we been passed?
    //
    switch(pcCmd->ucCommand)
    {
        //
        // We are being asked to start a programming operation.
        //
        case DFU_CMD_PROG:
        {
            tDFUDownloadProgHeader *psHdr;

            //
            // Extract the address and size from the command header.
            //
            psHdr = (tDFUDownloadProgHeader *)pcCmd;

            //
            // Is the passed address range valid?
            //
            if(FlashRangeCheck((unsigned long)readShort(&(psHdr->usStartAddr)) * 1024,
                                         readLong(&(psHdr->ulLength))))
            {
                //
                // Yes - remember the range passed so that we will write the
                // passed data to the correct place.
                //
                g_sNextDownload.pcStart =
                    (unsigned char *)((unsigned long)readShort(&(psHdr->usStartAddr)) * 1024);
                g_sNextDownload.ulLength = readLong(&(psHdr->ulLength));

                //
                // If we have been provided with a progress reporting hook
                // function, remember the total length of the image so that
                // we can report this later.
                //
#ifdef BL_PROGRESS_FN_HOOK
                g_ulImageSize = psHdr->ulLength;
#endif

                //
                // Also set the upload address and size to match this download
                // so that, by default, the host will get back what it just
                // wrote if it performs an upload without an intermediate
                // DFU_CMD_READ to set the address and size.
                //
                g_sNextUpload.pcStart =
                    (unsigned char *)((unsigned long)readShort(&(psHdr->usStartAddr)) * 1024);
                g_sNextUpload.ulLength = readLong(&(psHdr->ulLength));


                //
                // Also remember that we have data in this packet to write.
                //
                g_pcDFUWrite = (unsigned char *)(psHdr + 1);
                g_usDFUBufferUsed = ulSize - sizeof(tDFUDownloadHeader);

                //
                // If a start signal hook function has been provided, call it
                // here since we are about to start a new download.
                //
#ifdef BL_START_FN_HOOK
                BL_START_FN_HOOK();
#endif

                //
                // Tell the main thread to write the data we just received it.
                //
                HWREGBITW(&g_ulCommandFlags, CMD_FLAG_WRITE, 1);
            }
            else
            {
                //
                // The flash range was invalid so switch to error state.
                //
                return(false);
            }
            break;
        }
        
#ifdef ENABLE_READ
        //
        // We are being passed the position and size of a block of flash to
        // return in a following upload operation.
        //
        case DFU_CMD_READ:
        {
            tDFUDownloadReadCheckHeader *psHdr;

            //
            // Extract the address and size from the command header.
            //
            psHdr = (tDFUDownloadReadCheckHeader *)pcCmd;

            //
            // Is the passed address range valid and the flash unlocked
            //
            if(FlashRangeCheck((unsigned long)readShort(&(psHdr->usStartAddr)) * 1024, readLong(&(psHdr->ulLength))))
            {
                //
                // Yes - remember the range passed so that we will return
                // this block of flash on the next upload request.
                //
                g_sNextUpload.pcStart =
                    (unsigned char *)((unsigned long)readShort(&(psHdr->usStartAddr)) * 1024);
                g_sNextUpload.ulLength = readLong(&(psHdr->ulLength));
            }
            else
            {
                //
                // The flash range was invalid so switch to error state.
                //
                return(false);
            }
            break;
        }
#endif

        //
        // We are being passed the position and size of a block of flash which
        // we will check to ensure that it is erased.
        //
        case DFU_CMD_CHECK:
        {
            tDFUDownloadReadCheckHeader *psHdr;
            unsigned short *pusCheck;
            unsigned long ulLoop;

            //
            // Extract the address and size from the command header.
            //
            psHdr = (tDFUDownloadReadCheckHeader *)pcCmd;

            //
            // Make sure the range we have been passed is within the area of
            // flash that we are allowed to look at.
            //
            if(FlashRangeCheck((unsigned long)readShort(&(psHdr->usStartAddr)) * 1024, readLong(&(psHdr->ulLength))))
            {
                //
                // The range is valid so perform the check here.
                //
                pusCheck = (unsigned short *)((unsigned long)readShort(&(psHdr->usStartAddr)) * 1024);

                //
                // Check each word in the range to ensure that it is erased.  If
                // not, set the error status and return.
                //
                for(ulLoop = 0; (ulLoop < readLong(&(psHdr->ulLength))) && ((unsigned long) pusCheck < 0x3F7F80); ulLoop++)
                {
                    if(*pusCheck != 0xFFFF)
                    {
                        g_eDFUStatus = STATUS_ERR_CHECK_ERASED;
                        return(false);
                    }
                    pusCheck++;
                }

                //
                // If we get here, the check passed so set the status to
                // indicate this.
                //
                g_eDFUStatus = STATUS_OK;
            }
            else
            {
                //
                // The flash range was invalid so switch to error state.
                //
                return(false);
            }
            break;
        }

        //
        // We are being asked to erase a block of flash.
        //
        case DFU_CMD_ERASE:
        {
            tDFUDownloadEraseHeader *psHdr;
            volatile unsigned short usTemp;
            //
            // Extract the address and size from the command header.
            //
            psHdr = (tDFUDownloadEraseHeader *)pcCmd;


            usTemp = readShort(&(psHdr->usNumBlocks));
            //
            // Make sure the range we have been passed is within the area of
            // flash that we are allowed to look at.
            //
            if(FlashRangeCheck((unsigned long)readShort(&(psHdr->usStartAddr)) * 1024,
                               ((unsigned long)readShort(&(psHdr->usNumBlocks)) *
                                1024 )))
            {
                //
                // The range is valid so tell the main loop to erase the
                // block.
                //
                g_sErase.pcStart =(unsigned char *)
                                   ((unsigned long)readShort(&(psHdr->usStartAddr)) * 1024);
                g_sErase.ulLength = ((unsigned long)readShort(&(psHdr->usNumBlocks)) *
                                     1024);
                HWREGBITW(&g_ulCommandFlags, CMD_FLAG_ERASE, 1);
            }
            else
            {
                //
                // The flash range was invalid so switch to error state.
                //
                return(false);
            }
            break;
        }

        //
        // We are being asked to send back device information on the next
        // upload request.
        //
        case DFU_CMD_INFO:
        {
            // Update lock status
            g_sDFUDeviceInfo.ucLocked = CsmRegs.CSMSCR.bit.SECURE;
    
            //
            // Register that we need to send the device info structure on the
            // next upload request.
            //
            g_sNextUpload.pcStart = (unsigned char *)&g_sDFUDeviceInfo;
            g_sNextUpload.ulLength = sizeof(tDFUDeviceInfo);

            //
            // Make sure we don't append the DFU_CMD_PROG header when we send
            // back the data.
            //
            g_bSuppressUploadHeader = true;
            break;
        }

        //
        // We are being asked to set the format of uploaded images.
        //
        case DFU_CMD_BIN:
        {
            tDFUDownloadBinHeader *psHdr;

            //
            // Extract the requried format the command header.
            //
            psHdr = (tDFUDownloadBinHeader *)pcCmd;

            //
            // Set the global format appropriately.
            //
            g_bUploadBinary = psHdr->bBinary ? true : false;
            break;
        }

#ifdef ENABLE_CSM_CONTROL        
        //
        // We are being asked to lock or unlock flash
        //
        case DFU_CMD_CSM:
        {
            tDFUDownloadCSMHeader *psHdr;

            //
            // Extract the requried format the command header.
            //
            psHdr = (tDFUDownloadCSMHeader *)pcCmd;
            //Are we locking the device
            if(psHdr->ucLock)
            {
                //If so lock it
                CsmRegs.CSMSCR.bit.FORCESEC = 1;
            }
            else
            {
                if(psHdr->ucSize == 16)
                {
                    // Copy pointer to received key
                    g_pucReceivedKey = (unsigned char *)(psHdr + 1);
                    // Tell the main thread to check the key    
                    HWREGBITW(&g_ulCommandFlags, CMD_FLAG_CSM, 1);
                    
