matthewpanizza/SolarPack-MPPT/device_support/f2806x/v151/MWare/boot_loader/bl_usb.c
                }
                else
                {
                    // Generate and send seed
                    GenerateSeed();
                    g_bUploadBinary = true;
                    g_sNextUpload.pcStart =  g_pucSeedBuffer;
                    g_sNextUpload.ulLength = 16;
                    
                }
                
            }
            break;
        }        
#endif

        //
        // We are being asked to prepare to reset the board and, as a result,
        // run the main application image.
        //
        case DFU_CMD_RESET:
        {
            //
            // Tell the main thread that it's time to go bye-bye...
            //
            HWREGBITW(&g_ulCommandFlags, CMD_FLAG_RESET, 1);

            break;
        }

        //
        // We have been passed an unrecognized command identifier so report an
        // error.
        //
        default:
        {
            g_eDFUStatus = STATUS_ERR_VENDOR;
            return(false);
        }
    }

    return(true);
}

//*****************************************************************************
//
//! EP0 Data callback
//!
//! \param ulSize The size of data available in EP0.
//! 
//! This callback function is called when data is received for the DATA phase
//! of an EP0 OUT transaction.  This data will either be a block of download
//! data (if we are in STATE_DNLOAD_IDLE) or a new command (if we are in
//! STATE_IDLE).
//
//*****************************************************************************
void
HandleEP0Data(unsigned long ulSize)
{
    tBoolean bRetcode;

    if(g_eDFUState == STATE_IDLE)
    {
        //
        // This must be a new DFU download command header so parse it and
        // determine what to do next.
        //
        bRetcode = ProcessDFUDnloadCommand((tDFUDownloadHeader *)g_pcDFUBuffer,
                                           ulSize);

        //
        // Did we receive a recognized and valid command?
        //
        if(!bRetcode)
        {
            //
            // No - set the error state.  The status is set within the
            // ProcessDFUDnloadCommand() function.
            //
            g_eDFUState = STATE_ERROR;
            return;
        }
    }
    else
    {
        //
        // If we are not in STATE_IDLE, this must be a block of data for an
        // ongoing download so signal the main thread to write it to flash.
        //
        g_usDFUBufferUsed = (unsigned short)ulSize;
        g_pcDFUWrite = g_pcDFUBuffer;

        //
        // Tell the main thread to write the new data.
        //
        HWREGBITW(&g_ulCommandFlags, CMD_FLAG_WRITE, 1);
    }

    //
    // Move to STATE_DNLOAD_SYNC since we now expect USBD_DFU_REQUEST_GETSTATUS
    // before the next USBD_DFU_REQUEST_DNLOAD.
    //
    g_eDFUState = STATE_DNLOAD_SYNC;
}

//*****************************************************************************
//
//! Handle bus resets
//!
//! This function is called if the USB controller detects a reset condition on
//! the bus.  If we are not in the process of downloading a new image, we use
//! this as a signal to reboot and run the main application image.
//
//*****************************************************************************
void
HandleReset(void)
{
    //
    // Are we currently in the middle of a download operation?
    //
    if((g_eDFUState != STATE_DNLOAD_IDLE) && (g_eDFUState != STATE_DNLOAD_SYNC) &&
       (g_eDFUState != STATE_IDLE))
    {
        //
        // No - tell the main thread that it should reboot the system assuming
        // that we are already configured.  If we don't check that we are
        // already configured, this will cause a reset during initial
        // enumeration and that wouldn't be very helpful.
        //
        if(g_bAddressSet)
        {
            HWREGBITW(&g_ulCommandFlags, CMD_FLAG_RESET, 1);
        }
    } else
    g_eDFUState = STATE_IDLE;
}

//*****************************************************************************
//
//! Handle cases where the USB host disconnects.
//
//*****************************************************************************
void
HandleDisconnect(void)
{
    //
    // For error resilience, it may be desireable to note if the host
    // disconnects and, if partway through a main image download, clear the
    // first block of the flash to ensure that the image is not considered
    // valid on the next boot.  For now, however, we merely wait for the host
    // to connect again, remaining in DFU mode.
    //

    //
    // Remember that we are waiting for enumeration.
    //
    g_bAddressSet = false;
}


//*****************************************************************************
//
//! Compact a byte array (0x00XX, 0x00YY) into a word array (0xXXYY)
//! 
//! \param pucBuffer Buffer to compact
//! \param ulBufferSize Buffer size before compaction
//
//*****************************************************************************
void CompactBuffer(unsigned char *pucBuffer, unsigned long ulBufferSize)
{
    unsigned char *pucCurrentByte, *pucDestWord;
    
    pucDestWord = pucBuffer;
    pucCurrentByte = pucBuffer;
    
    for(;pucDestWord < pucBuffer + (ulBufferSize/2);)
    {
            *pucDestWord++ = ((*pucCurrentByte & 0xFF) << 8) | (*(pucCurrentByte + 1) & 0xFF);
            pucCurrentByte += 2;
    }
        
    
}

#ifdef ENABLE_FAILSAFE
//*****************************************************************************
//
//! Copy the bootloader from flash sector H to flash sector G
//
//*****************************************************************************
void CopyBLHtoG(void)
{
    
    //Copy Bootloader entry table
    MemCopy((Uint16 *)&BLTableStart, (Uint16 *)&BLTableEnd, (Uint16 *)g_pcCopyBuffer);
    Flash2806x_Program((Uint16 *)&BLTableStart+0x4000, 
                       (Uint16 *) g_pcCopyBuffer, 
                       (unsigned long)&BLTableEnd - (unsigned long)&BLTableStart, 
                       &g_FlashStatus);
    
    // Copy Init Section
    MemCopy((Uint16 *)&InitLoadStart, (Uint16 *)&InitLoadEnd, (Uint16 *)g_pcCopyBuffer);
    Flash2806x_Program((Uint16 *)&InitLoadStart+0x4000, 
                       (Uint16 *) g_pcCopyBuffer, 
                       (unsigned long)&InitLoadEnd - (unsigned long)&InitLoadStart, 
                       &g_FlashStatus);

    // Copy BL Kernel
    MemCopy((Uint16 *)&RamfuncsLoadStart, (Uint16 *)&RamfuncsLoadEnd, (Uint16 *)g_pcCopyBuffer);
    Flash2806x_Program((Uint16 *)&RamfuncsLoadStart+0x4000, 
                       (Uint16 *) g_pcCopyBuffer, 
                       (unsigned long)&RamfuncsLoadEnd - (unsigned long)&RamfuncsLoadStart, 
                       &g_FlashStatus);
                            
    // Copy Failsafe Entry
    MemCopy((Uint16 *)&FailsafeLoadStart, (Uint16 *)&FailsafeLoadEnd, (Uint16 *)g_pcCopyBuffer);
    Flash2806x_Program((Uint16 *)&FailsafeRunStart, 
                       (Uint16 *) g_pcCopyBuffer, 
                       (unsigned long)&FailsafeLoadEnd - (unsigned long)&FailsafeLoadStart, 
                       &g_FlashStatus);
                             
