matthewpanizza/SolarPack-MPPT/device_support/f2806x/v151/MWare/boot_loader/bl_usb.c
}

//*****************************************************************************
//
//! Copy the bootloader from flash sector G to flash sector H
//
//*****************************************************************************
void CopyBLGtoH(void)
{
    
    //Copy Bootloader entry table
    FailSafeMemCopy((Uint16 *)&BLTableStart+0x4000, (Uint16 *)&BLTableEnd+0x4000, (Uint16 *)g_pcCopyBuffer);
    Flash2806x_Program((Uint16 *)&BLTableStart, 
                       (Uint16 *) g_pcCopyBuffer, 
                       (unsigned long)&BLTableEnd - (unsigned long)&BLTableStart, 
                       &g_FlashStatus);
    
    // Copy Init Section
    FailSafeMemCopy((Uint16 *)&InitLoadStart+0x4000, (Uint16 *)&InitLoadEnd+0x4000, (Uint16 *)g_pcCopyBuffer);
    Flash2806x_Program((Uint16 *)&InitLoadStart, 
                       (Uint16 *) g_pcCopyBuffer, 
                       (unsigned long)&InitLoadEnd - (unsigned long)&InitLoadStart, 
                       &g_FlashStatus);

    // Copy BL Kernel
    FailSafeMemCopy((Uint16 *)&RamfuncsLoadStart+0x4000, (Uint16 *)&RamfuncsLoadEnd+0x4000, (Uint16 *)g_pcCopyBuffer);
    Flash2806x_Program((Uint16 *)&RamfuncsLoadStart, 
                       (Uint16 *) g_pcCopyBuffer, 
                       (unsigned long)&RamfuncsLoadEnd - (unsigned long)&RamfuncsLoadStart, 
                       &g_FlashStatus);

    // Copy Failsafe Entry
    FailSafeMemCopy((Uint16 *)&FailsafeRunStart, (Uint16 *)&FailsafeRunStart+(unsigned long)&FailsafeLoadEnd - (unsigned long)&FailsafeLoadStart, (Uint16 *)g_pcCopyBuffer);
    Flash2806x_Program((Uint16 *)&FailsafeLoadStart, 
                       (Uint16 *) g_pcCopyBuffer, 
                       (unsigned long)&FailsafeLoadEnd - (unsigned long)&FailsafeLoadStart, 
                       &g_FlashStatus);
                               
}

//*****************************************************************************
//
//! Erase and program sector A of flash with the entry point for the failsafe
//! bootloader.
//
//*****************************************************************************
void ProgramBLFailsafeVector(void)
{                                              
    
    // Copy Failsafe Codestart                                             
    MemCopy((Uint16 *)&code_start_f, (Uint16 *)(&code_start_f + 1), (Uint16 *)g_pcCopyBuffer); 
    
    // Erase Sector A
    Flash2806x_Erase(0x01, &g_FlashStatus);
    
    // Program Boot to Flash Vector with Failsafe codestart
    Flash2806x_Program((Uint16 *)0x3F7FF6, 
                       (Uint16 *) g_pcCopyBuffer, 
                        2, 
                       &g_FlashStatus);
}
#endif

//*****************************************************************************
//
//! Erase and program sector A of flash with the entry point for the normal
//! bootloader.
//
//*****************************************************************************
void ProgramBLNormalVector(void)
{
    // Copy Failsafe Codestart                                             
    MemCopy((Uint16 *)&code_start_n, (Uint16 *)(&code_start_n + 1), (Uint16 *)g_pcCopyBuffer); 
    
    // Erase Sector A
    Flash2806x_Erase(0x01, &g_FlashStatus);
    
    // Program Boot to Flash Vector with Normal codestart
    Flash2806x_Program((Uint16 *)0x3F7FF6, 
                       (Uint16 *) g_pcCopyBuffer, 
                        2, 
                       &g_FlashStatus);
}



//*****************************************************************************
//
//! This is the main routine for handling updating over USB.
//!
//! This function forms the main loop of the USB DFU updater.  It polls for
//! commands sent from the USB request handlers and is responsible for
//! erasing flash blocks, programming data into erased blocks and resetting
//! the device.
//!
//! \return None.
//
//*****************************************************************************
void
UpdaterUSB(void)
{
    unsigned long  ulStart, ulTemp;
    unsigned short usUsed;


    usUsed = 0;

    // Initialize Flash functions
    FlashAPIInit();

    //
    // Loop forever waiting for the USB interrupt handlers to tell us to do
    // something.
    //
    while(1)
    {
        while((g_ulCommandFlags & 0xFFFF) == 0)
        {
            //
            // Wait for something to do.
            //
#ifdef ENABLE_WATCHDOG
            EALLOW;
            SysCtrlRegs.WDKEY = 0x0055;
            SysCtrlRegs.WDKEY = 0x00AA;
            EDIS;        
#endif                        
        }

        //
        // Are we being asked to perform a system reset?
        //
        if(HWREGBITR(&g_ulCommandFlags, CMD_FLAG_RESET))
        {
            //
            // Time to go bye-bye...  This will cause the microcontroller
            // to reset; no further code will be executed.
            //
            
            // Enable watchdog reset
            SysCtrlRegs.SCSR &= ~0x02;
            // Enable the Watchdog
            SysCtrlRegs.WDCR = 0x28;
            // Force a reset
            SysCtrlRegs.WDCR = 0x00;

            //
            // The microcontroller should have reset, so this should never be
            // reached.  Just in case, loop forever.
            //
            while(1)
            {
            }
        }

#ifdef ENABLE_CSM_CONTROL        
        //
        // Are we being asked to unlock CSM
        //
        if(HWREGBITR(&g_ulCommandFlags, CMD_FLAG_CSM))
        {
            GenerateKey();
            for(ulTemp = 0; ulTemp<16; ulTemp++)
            {
                if(g_pucKeyBuffer[ulTemp]!= g_pucReceivedKey[ulTemp])
                    break;
            }
            if(ulTemp == 16)
                UnlockDevice();
            //
            // Clear the command flag to indicate that we are done.
            //
            HWREGBITW(&g_ulCommandFlags, CMD_FLAG_CSM, 0);            
            

        }
#endif        

        //
        // Are we being asked to erase a range of blocks in flash?
        //
        if(HWREGBITR(&g_ulCommandFlags, CMD_FLAG_ERASE))
        {
#ifdef ENABLE_FAILSAFE
            //Are we NOT in failsafe mode?
            if(!g_bFailsafe)
            {

