matthewpanizza/SolarPack-MPPT/device_support/f2806x/v151/MWare/boot_loader/bl_usb.c
                //If so, erase sectors B through G
                Flash2806x_Erase(0x7E, &g_FlashStatus);

                CopyBLHtoG();
                
                ProgramBLFailsafeVector();
                
                //Set failsafe flag
                g_bFailsafe = true;
                
            }
        
            // Erase normal bootloader sector (H)
            Flash2806x_Erase(0x80, &g_FlashStatus);
            
            CopyBLGtoH();
            ProgramBLNormalVector();
            
            //Erase the failsafe copy of the bootloader
            Flash2806x_Erase(0x40, &g_FlashStatus);
            g_bFailsafe = false;
#else                

            // Figure out what to erase
            ulTemp = FlashAPIIndex((unsigned long)g_sErase.pcStart, g_sErase.ulLength);
            //Are we erasing sector A
            if(ulTemp & 0x01)
                //Erase sector A and reprogram reset vector
                ProgramBLNormalVector();
            
            ulTemp &= 0x7E;
            // erase the rest of flash
            Flash2806x_Erase(ulTemp, &g_FlashStatus);

#endif                
            

            //
            // Clear the command flag to indicate that we are done.
            //
            HWREGBITW(&g_ulCommandFlags, CMD_FLAG_ERASE, 0);
        }

        //
        // Are we being asked to program a block of flash?
        //
        if(HWREGBITR(&g_ulCommandFlags, CMD_FLAG_WRITE))
        {
            //
            // Decrypt the data if required.
            //
#ifdef BL_DECRYPT_FN_HOOK
            BL_DECRYPT_FN_HOOK(g_pcDFUWrite, g_usDFUBufferUsed);
#endif

            //
            // Where will the new block be written?
            //
            ulStart = (unsigned long)(g_sNextDownload.pcStart);


            usUsed = g_usDFUBufferUsed/2;

            //Compact buffer from bytes into words    
            CompactBuffer(g_pcDFUWrite, g_usDFUBufferUsed);

            // Check for programming of the boot to flash location
            if((ulStart < 0x3F7FF6) && ((ulStart + usUsed) > 0x3F7FF6)){
            	//adjust programming to program around boot to flash location

				//
				// Write the new block of data to the flash before the begin location
				//
				if(Flash2806x_Program((Uint16 *)ulStart, (Uint16 *) g_pcDFUWrite, (0x3F7FF6 - ulStart), &g_FlashStatus))
				{
					//Programming Failed for some reason, enter error state
					g_eDFUState = STATE_ERROR;
					g_eDFUStatus = STATUS_ERR_PROG;

				}else{
					//
					// Write the new block of data to the flash after the begin location (CSM)
					//
					if(Flash2806x_Program((Uint16 *)ulStart + (0x3F7FF6 - ulStart) + 0x02, (Uint16 *) ((unsigned long)g_pcDFUWrite + (0x3F7FF6 - ulStart) + 0x02), (usUsed - ((0x3F7FF6 - ulStart) + 0x02)), &g_FlashStatus))
					{
						//Programming Failed for some reason, enter error state
						g_eDFUState = STATE_ERROR;
						g_eDFUStatus = STATUS_ERR_PROG;
					}

				}

            }else{

	            //
	            // Write the new block of data to the flash
	            //
	            if(Flash2806x_Program((Uint16 *)ulStart, (Uint16 *) g_pcDFUWrite, usUsed, &g_FlashStatus))
	            {
	                //Programming Failed for some reason, enter error state
	                g_eDFUState = STATE_ERROR;
	                g_eDFUStatus = STATUS_ERR_PROG;
	            }
            }
    
            //
            // Update our position and remaining size.
            //
            g_sNextDownload.pcStart += usUsed;
            g_sNextDownload.ulLength -= usUsed;

            //
            // Clear the command flag to indicate that we are done.
            //
            HWREGBITW(&g_ulCommandFlags, CMD_FLAG_WRITE, 0);

            //
            // If a progress hook function has been provided, call
            // it here.
            //
#ifdef BL_PROGRESS_FN_HOOK
            BL_PROGRESS_FN_HOOK(g_ulImageSize - g_sNextDownload.ulLength,
                                g_ulImageSize);
#endif

            //
            // If we just finished the download and an end signal hook function
            // has been provided, call it too.
            //
#ifdef BL_END_FN_HOOK
            if(g_sNextDownload.ulLength == 0)
            {
                BL_END_FN_HOOK();
            }
#endif
        }
    }
}

//*****************************************************************************
//
//! Configure the USB controller and place the DFU device on the bus.
//!
//! This function configures the USB controller for DFU device operation,
//! initializes the state machines required to control the firmware update and
//! places the device on the bus in preparation for requests from the host.  It
//! is assumed that the main system clock has been configured at this point.
//!
//! \return None.
//
//*****************************************************************************
void
ConfigureUSBInterface(void)
{
    unsigned long ulTemp = 0;
    //
    // Initialize our device information structure.
    //
    writeShort(&(g_sDFUDeviceInfo.usFlashBlockSize), DFU_REPORTED_PAGE_SIZE);
    writeShort(&(g_sDFUDeviceInfo.usNumFlashBlocks), 
                (FLASH_END_ADDR - FLASH_START_ADDR) / DFU_REPORTED_PAGE_SIZE);
    writeLong(&(g_sDFUDeviceInfo.ulClassInfo), DevEmuRegs.CLASSID.all);
    writeLong(&(g_sDFUDeviceInfo.ulPartInfo),  PartIdRegs.PARTID.all);
    writeLong(&(g_sDFUDeviceInfo.ulAppStartAddr), APP_START_ADDRESS);
    writeLong(&(g_sDFUDeviceInfo.ulFlashTop), FLASH_END_ADDR);


    g_sDFUDeviceInfo.ucLocked = CsmRegs.CSMSCR.bit.SECURE;
    
#ifdef ENABLE_FAILSAFE    
    ulTemp |= TI_FEATURE_FAILSAFE;
#endif
#ifdef ENABLE_CSM_CONTROL
    ulTemp |= TI_FEATURE_CSM_CONTROL;
#endif
#ifdef ENABLE_READ
    ulTemp |= TI_FEATURE_READ;
#endif
#ifdef ENABLE_DECRYPTION
    ulTemp |= TI_FEATURE_DECRYPTION;
#endif

    writeLong(&(g_sDFUDeviceInfo.ulFeatures), ulTemp);
    
    //
    // Publish our DFU device descriptors and place the device on the bus.
    //
    USBBLInit();
}

#if (defined USB_HAS_MUX) || (defined DOXYGEN)
//*****************************************************************************
//
//! Configures and set the mux selecting USB device-mode operation.
//!
//! On target boards which use a multiplexer to switch between USB host and
//! device operation, this function is used to configure the relevant GPIO
//! pin and drive it such that the mux selects USB device-mode operation.
//! If \b USB_HAS_MUX is not defined in bl_config.h, this function is compiled
//! out.
//!
//! \return None.
//
//*****************************************************************************
static void
SetUSBMux(void)
{

    //
    // Make the pin be an output.
    //
#if USB_MUX_PIN > 31
    GpioCtrlRegs.GPBDIR.all |= (1 << (USB_MUX_PIN - 32));
#else
    GpioCtrlRegs.GPADIR.all |= (1 << USB_MUX_PIN);
#endif


#if USB_MUX_PIN < 16
    GpioCtrlRegs.GPAMUX1.all &= ~(3 << (2 * USB_MUX_PIN));
#elif USB_MUX_PIN < 32
    GpioCtrlRegs.GPAMUX2.all &= ~(3 << (2 * (USB_MUX_PIN - 16)));
#elif USB_MUX_PIN < 48
    GpioCtrlRegs.GPBMUX1.all &= ~(3 << (2 * (USB_MUX_PIN - 32)));
#else
    GpioCtrlRegs.GPBMUX2.all &= ~(3 << (2 * (USB_MUX_PIN - 48)));
#endif
                             
    //
    // Write the pin to the appropriate level to select USB device mode.
    //
    
    //Clear out previous state
    //Assert new state   
#if USB_MUX_PIN > 31
    GpioDataRegs.GPBDAT.all &= ~(1 << (USB_MUX_PIN - 32));
    GpioDataRegs.GPBDAT.all |= (USB_MUX_DEVICE << (USB_MUX_PIN - 32));
#else
    GpioDataRegs.GPADAT.all &= ~(1 << USB_MUX_PIN);
    GpioDataRegs.GPADAT.all |= (USB_MUX_DEVICE << USB_MUX_PIN);
#endif
                       
